АлогистикТест2/src/Documents/АвансовыйОтчет/АвансовыйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АвансовыйОтчет</name>
  <basedOn>Document.ПриходныйОрдер</basedOn>
  <basedOn>Document.РасходИзКассы</basedOn>
  <basedOn>Document.РасходСоСчета</basedOn>
  <registerRecords>AccumulationRegister.ПартииТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОплатаСчетовИЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПодотчетниками</registerRecords>
  <registerRecords>AccumulationRegister.ПлатежныйКалендарь</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыКПоступлениюНаСклады</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыКассовыйМетод</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыНаСкладах</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыОтложенные</registerRecords>
  <registerRecords>AccumulationRegister.ЗакупкиДляКУДиР</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыНераспределенные</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РасходСоСчета</types>
      <types>DocumentRef.РасходИзКассы</types>
      <types>DocumentRef.ПриходныйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСВключатьВСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыданныеАвансы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.РасходИзКассы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.Ячейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВходящегоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВходящегоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварыДляПроизводства</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВходящегоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВходящегоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакАванса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ДополнительныеРасходы</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВходящегоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВходящегоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетНаОплату</name>
      <type>
        <types>DocumentRef.СчетНаОплатуПоставщика</types>
      </type>
    </attributes>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/CommonModules/ДатыЗапретаИзмененияПереопределяемый/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Даты запрета изменения".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет изменить работу интерфейса при встраивании.
//
// Параметры:
//  НастройкиРаботыИнтерфейса - Структура - содержит свойство:
//   * ИспользоватьВнешнихПользователей - Булево - (начальное значение Ложь),
//     если установить Истина, тогда даты запрета можно будет настраивать для внешних пользователей.
//
Процедура НастройкаИнтерфейса(НастройкиРаботыИнтерфейса) Экспорт
	
	НастройкиРаботыИнтерфейса.ИспользоватьВнешнихПользователей = Ложь;
	
КонецПроцедуры

// Содержит описание таблиц и полей объектов для проверки запретов изменения данных.
//   Вызывается из процедуры ИзменениеЗапрещено общего модуля ДатыЗапретаИзменения,
//   используемой в подписке на событие ПередЗаписью объекта для проверки наличия
//   запретов и отказа от изменений запрещенного объекта.
//
// Параметры:
//  ИсточникиДанных - ТаблицаЗначений - с колонками:
//   * Таблица     - Строка - полное имя объекта метаданных,
//                   например, Метаданные.Документы.ПриходнаяНакладная.ПолноеИмя().
//   * ПолеДаты    - Строка - имя реквизита объекта или табличной части,
//                   например "Дата", "Товары.ДатаОтгрузки".
//   * Раздел      - Строка - имя предопределенного элемента
//                   "ПланВидовХарактеристикСсылка.РазделыДатЗапрета".
//   * ПолеОбъекта - Строка - имя реквизита объекта или реквизита табличной части,
//                   например "Организация", "Товары.Склад".
//
//  Для добавления строки имеется процедура ДобавитьСтроку в общем модуле ДатыЗапретаИзменения.
//
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АвансовыйОтчет", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АктВыполненныхРабот",			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АмортизацияВА", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Бюджет", 						"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводНачальныхОстатков",	 		"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Взаимозачет", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыработкаВА", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Доверенность", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ДополнительныеРасходы", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаданиеНаРаботу", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказНаПроизводство", 			"Дата", "УправленческийУчет", "Организация");
	// "Документ.ЗаказПокупателя" - вынесен в отдельный раздел
	// "Документ.ЗаказПоставщику" - вынесен в отдельный раздел
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗакрытиеМесяца", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеПараметровВА", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнвентаризацияЗапасов", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КадровоеПеремещение", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НачислениеЗарплаты", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НачислениеНалогов", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Операция", 						"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОприходованиеЗапасов", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтчетКомиссионера", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтчетКомитенту", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтчетОПереработке", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтчетОРозничныхПродажах",		"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтчетПереработчика", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаВА", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеДС", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеДСПлан", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеЗапасов", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеПоЯчейкам", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПереоценкаВРозницеСуммовойУчет", "Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПланПродаж", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПлатежнаяВедомость", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПлатежноеПоручение", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеВКассу", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеДСПлан", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеНаСчет", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриемНаРаботу", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПринятиеКУчетуВА", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриходнаяНакладная", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриходныйОрдер", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПрочиеРасходы", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РаспределениеЗатрат", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасходДСПлан", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасходИзКассы", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасходнаяНакладная", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасходныйОрдер", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасходСоСчета", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасходыПриИмпорте", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РезервированиеЗапасов", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СборкаЗапасов", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СдельныйНаряд", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеВА", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеЗапасов", 				"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СчетНаОплату", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СчетНаОплатуПоставщика",			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СчетФактура", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СчетФактураПолученный", 			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Табель", 						"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Увольнение", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УчетВремени", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЧекККМ", 						"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЧекККМВозврат", 					"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОперацияПоПлатежнымКартам",		"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ДоговорКредитаИЗайма",			"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НачисленияПоКредитамИЗаймам",	"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаПоступления",		"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаРеализации",		"Дата", "УправленческийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПересортицаЗапасов",				"Дата", "УправленческийУчет", "Организация");
	
	// Дополнительные разделы для документов Заказ покупателя, Заказ поставщику
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказПокупателя", 				"Дата", "ЗаказыПокупателей", "СостояниеЗаказа");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказПоставщику", 				"Дата", "ЗаказыПоставщиков", "СостояниеЗаказа");
	
	//++рфп 
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_СменныйРапортЦЛП",			"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ПеремещениеЛесопродукции",	"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_СборкаЗапасов", 				"Дата", "ПроизводствоЦЛП", "");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ВводНачальныхОстатков", 		"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ВводНачальныхОстатковОтходы","Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ВводПлановыхПоказателей",	"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ВзаиморасчетыПоЗаказам",		"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ВнутренняяПередачаМеждуОрганизациями","Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ВозвратОкорки",				"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ВозвратОтветхранения",		"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ЗагрузкаКонтейнера",			"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ЗаказНаПроизводство",		"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ЗаказПокупателя",			"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ИнвентаризацияШтабелей",		"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_Инвойс",						"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ОтгрузкаЩепы",				"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ОценкаСырья",				"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ПередачаНаОтветхранение",	"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ПередачаСырьяВПроизводство",	"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ПеремещениеЗапасов",			"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ПересортицаНоменклатуры",	"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ПогрузкаСудовыхПартий",		"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ПоступлениеДенежныхСредств",	"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ПриемкаЛесопродукции",		"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ПриемкаСОтветхранения",		"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ПриходнаяНакладнаяПеревалка","Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_РасформированиеПакетов",		"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_РасходнаяНакладная",			"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_РасходнаяНакладная_Отходы",	"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_РасходнаяНакладнаяПрочее",	"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_РеализацияПродукцииЭкспорт",	"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_РезервизрованиеЗапасов",		"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_РучноеИзменениеПараметровПакета",	"Дата", "ПроизводствоЦЛП", "");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_СменныйРапортОтходы",		 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_СортировкаЛесопродукции",	 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ТранспортировкаЗапасов",		 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ТранспортировочныеПартии",	 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_УпаковкаНоменклатуры",		 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_УстановкаЦенНаЛесопродукцию", "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_УстановкаЦенПоЗаказу",		 "Дата", "ПроизводствоЦЛП", "");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.рфп_ОтгрузкаВагона",				 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.рфп_РапортЛущение",				 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.рфп_РапортОкорка",				 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.рфп_РапортРебросклей",			 "Дата", "ПроизводствоЦЛП", "");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ВременныеТаможенныеДекларации","Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ЗаявкаФСС",			 		 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ПростойОборудования",		 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ГрафикРаботыУчастка",		 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ЗагрузкаВСушильнуюКамеру",	 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ВыгрузкаИзСушильнойКамеры",	 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_СборкаСухихПакетов",			 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ЛогистикаЖД",			 	 "Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_УстановкаАналитикиНоменклатуры","Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ЧисленныйСоставСмены",			"Дата", "ПроизводствоЦЛП", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ВводОбъемныхПроизводственныхПоказателей","Дата", "ПроизводствоЦЛП", "");
	
	//Проверка по разделу ЦЕХ
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_СкладскиеОперации"	, "Дата", "алк_Производство", "Участок.Цех");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_Производство"		, "Дата", "алк_Производство", "Участок.Цех");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ЧисленныйСоставСмены", "Дата", "алк_Производство", "Участок.Цех");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ВводОбъемныхПроизводственныхПоказателей", "Дата", "алк_Производство", "Участок.Цех");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_Перемещение"			, "Дата", "алк_Производство", "Участок.Цех");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ЗагрузкаВКамеру"		, "Дата", "алк_Производство", "Участок.Цех");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ВыгрузкаИзКамеры"	, "Дата", "алк_Производство", "Участок.Цех");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ЗагрузкаВКамеруПропарки"     , "Дата", "алк_Производство", "Участок.Цех");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ВыгрузкаИзКамерыПропарки"	, "Дата", "алк_Производство", "Участок.Цех");
	//\\
	//Проверка по разделу аддендумы
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_Аддендумы"			, "Дата", "алк_Аддендумы", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.алк_ПривязкаПакетовКАддендуму", "Дата", "алк_Аддендумы", "");
	//\\
КонецПроцедуры

// Позволяет переопределить выполнение проверок запретов по произвольному условию.
//
// Параметры:
//  Объект       - СправочникОбъект,
//                 ДокументОбъект,
//                 ПланВидовХарактеристикОбъект,
//                 ПланСчетовОбъект,
//                 ПланВидовРасчетаОбъект,
//                 БизнесПроцессОбъект,
//                 ЗадачаОбъект,
//                 ПланОбменаОбъект - объект данных (ПередЗаписью или ПриЧтенииНаСервере).
//               - РегистрСведенийНаборЗаписей,
//                 РегистрНакопленияНаборЗаписей,
//                 РегистрБухгалтерииНаборЗаписей,
//                 РегистрРасчетаНаборЗаписей - набор записей (ПередЗаписью или ПриЧтенииНаСервере).
//
//                 Для документов в свойство ДополнительныеСвойства вставляется свойство РежимЗаписи,
//                 если вызов делается в процессе записи документа.
//  
//  ПроверкаЗапретаИзменения    - Булево - когда Истина, тогда проверка изменения выполняется.
//                                Если установить Ложь, тогда проверка запрета изменения будет пропущена.
//
//  УзелПроверкиЗапретаЗагрузки - Неопределено - проверка запрета загрузки не выполняется.
//                              - ПланыОбменаСсылка - проверка запрета загрузки выполняется. Если
//                                установить Неопределено, проверка запрета загрузки будет пропущена.
//
//  ВерсияОбъекта               - Строка - начальное значение "". Проверяются обе версии объекта.
//                                Если установить "СтараяВерсия" или "НоваяВерсия", тогда будет
//                                выполнена проверка только старой или только новой версии объекта.
//
Процедура ПередПроверкойЗапретаИзменения(Объект,
                                         ПроверкаЗапретаИзменения,
                                         УзелПроверкиЗапретаЗагрузки,
                                         ВерсияОбъекта) Экспорт
	
	Если Объект.Метаданные().ПолноеИмя() = "Документ.ЗаказПокупателя" Тогда
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
			
			ПроверкаЗапретаИзменения = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФукнции
////////////////////////////////////////////////////////////////////////////////
// УНФ

// Позволяет переопределить выполнение проверок запретов по произвольному условию.
//
Процедура ПроверитьДатуЗапретаРедактированияЗаказНарядов(Форма, ТекущийОбъект, ОписаниеОшибки = Ложь, УзелПроверкиЗапретаЗагрузки = Неопределено) Экспорт
	
	ДанныеДляПроверки	= ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
	
	НоваяСтрока			= ДанныеДляПроверки.Добавить();
	НоваяСтрока.Дата	= ТекущийОбъект.Финиш;
	Новаястрока.Раздел	= ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.УправленческийУчет;
	НоваяСтрока.Объект	= ТекущийОбъект.Организация;
	
	НайденныеЗапреты	= Неопределено;
	СтандартнаяОбработка= Истина;
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("НоваяВерсия", Истина);
	ОписаниеДанных.Вставить("Данные", ТекущийОбъект.Ссылка);
	
	Форма.ТолькоПросмотр= ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ДанныеДляПроверки, ОписаниеДанных, ОписаниеОшибки, УзелПроверкиЗапретаЗагрузки);
	
КонецПроцедуры // ПроверитьЗаказНаряд()

// Начиная с версии 1.5.3.6 доступны для использования новые разделы.
//
// - ЗаказыПокупателей;
// - ЗаказыПоставщиков;
//
// Соответственно возможность редактирования (или запрет) для указанных документов устанавливается раздельно.
//
Процедура ОбновлениеРазделовДатЗапретаИзменений(ОбработкаЗавершена) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РазделЗаказыПокупателей.Пользователь,
	|	ИСТИНА КАК Использование
	|ПОМЕСТИТЬ РазделЗаказыПокупателей
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК РазделЗаказыПокупателей
	|ГДЕ
	|	РазделЗаказыПокупателей.Раздел = ЗНАЧЕНИЕ(ПланВидовХарактеристик.РазделыДатЗапретаИзменения.ЗаказыПокупателей)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазделЗаказыПоставщиков.Пользователь,
	|	ИСТИНА КАК Использование
	|ПОМЕСТИТЬ РазделЗаказыПоставщиков
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК РазделЗаказыПоставщиков
	|ГДЕ
	|	РазделЗаказыПоставщиков.Раздел = ЗНАЧЕНИЕ(ПланВидовХарактеристик.РазделыДатЗапретаИзменения.ЗаказыПоставщиков)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазделОсновной.Пользователь КАК Пользователь,
	|	РазделОсновной.ОписаниеДатыЗапрета КАК ОписаниеДатыЗапрета,
	|	РазделОсновной.ДатаЗапрета КАК ДатаЗапрета,
	|	ЕСТЬNULL(РазделЗаказыПокупателей.Использование, ЛОЖЬ) КАК РазделЗаказыПокупателейИспользуется,
	|	ЕСТЬNULL(РазделЗаказыПоставщиков.Использование, ЛОЖЬ) КАК РазделЗаказыПоставщиковИспользуется
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК РазделОсновной
	|		ЛЕВОЕ СОЕДИНЕНИЕ РазделЗаказыПокупателей КАК РазделЗаказыПокупателей
	|		ПО РазделОсновной.Пользователь = РазделЗаказыПокупателей.Пользователь
	|		ЛЕВОЕ СОЕДИНЕНИЕ РазделЗаказыПоставщиков КАК РазделЗаказыПоставщиков
	|		ПО РазделОсновной.Пользователь = РазделЗаказыПоставщиков.Пользователь
	|ГДЕ
	|	РазделОсновной.Раздел = ЗНАЧЕНИЕ(ПланВидовХарактеристик.РазделыДатЗапретаИзменения.УправленческийУчет)"
	);
	
	НачатьТранзакцию();
	Попытка
		
		ОбработкаЗавершена = Истина;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.РазделЗаказыПокупателейИспользуется
				ИЛИ Выборка.РазделЗаказыПоставщиковИспользуется Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Комментарий = НСтр("ru = 'Раздел добавлен автоматически при обновлении УНФ до версии 1.5.3.6'");
			
			МенеджерРегистра = РегистрыСведений.ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
			МенеджерРегистра.Пользователь = Выборка.Пользователь;
			МенеджерРегистра.ДатаЗапрета = Выборка.ДатаЗапрета;
			МенеджерРегистра.Раздел = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ЗаказыПокупателей;
			МенеджерРегистра.Объект = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ЗаказыПокупателей;
			МенеджерРегистра.ОписаниеДатыЗапрета = Выборка.ОписаниеДатыЗапрета;
			МенеджерРегистра.Комментарий = Комментарий;
			МенеджерРегистра.Записать();
			
			МенеджерРегистра = РегистрыСведений.ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
			МенеджерРегистра.Пользователь = Выборка.Пользователь;
			МенеджерРегистра.ДатаЗапрета = Выборка.ДатаЗапрета;
			МенеджерРегистра.Раздел = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ЗаказыПоставщиков;
			МенеджерРегистра.Объект = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ЗаказыПоставщиков;
			МенеджерРегистра.ОписаниеДатыЗапрета = Выборка.ОписаниеДатыЗапрета;
			МенеджерРегистра.Комментарий = Комментарий;
			МенеджерРегистра.Записать();
			
			ОбработкаЗавершена = Ложь; // Обработчик обновления считается выполненым, если записи не добавляются
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОбработкаЗавершена = Ложь;
		ЗаписьЖурналаРегистрации("Обновление разделов дат запрета изменений", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ДатыЗапретаИзменения, , ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
